Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། མཚེ་མའི་ལྷའི་གནས་ཐམས་ཅད་དང་། དགའ་ལྡན་གྱི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། འཕྲུལ་དགའི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། བདུད་ཀྱི་གནས་ཐམས་ཅད་དང་། འདོད་པའི་ཁམས་ཀྱི་ལྷའི་རིས་སུ་གཏོགས་པ་ཐམས་ཅད་དང་། ལྷའི་གནས་ཐམས་ཅད་དང་། ཀླུའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ཀླུའི་གནས་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་གནས་ཐམས་ཅད་དང་། སྲིན་པོའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། སྲིན་པོའི་གནས་ཐམས་ཅད་དང་། གྲུལ་བུམ་གྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། གྲུལ་བུམ་གྱི་གནས་ཐམས་ཅད་དང་། ཡི་དགས་ཀྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ཡི་དགས་ཀྱི་གནས་ཐམས་ཅད་དང་། དྲི་ཟའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། དྲི་ཟའི་གནས་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་གྱི་གནས་ཐམས་ཅད་དང་། ནམ་མཁའ་ལྡིང་གི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ནམ་མཁའ་ལྡིང་གི་གནས་ཐམས་ཅད་དང་། མིའམ་ཅིའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། མིའམ་ཅིའི་གནས་ཐམས་ཅད་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་ཐམས་ཅད་དང་། མིའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། མིའི་གནས་ཐམས་ཅད་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་གྱི་རྒྱུད་ཐམས་ཅད་དུ་ཆོས་ནི་སྟོན་ཏོ། །ཆོས་མ་ཡིན་པ་ནི་བཟློག་གོ །རྩོད་པ་ནི་ཞི་བར་བྱེད་དོ། །འཐབ་པ་ནི་རྣམ་པར་བཟློག་གོ །འཁྲུག་པ་ནི་ཉེ་བར་ཞི་བར་བྱེད་དོ། །གཡུལ་དུ་ལྷགས་པ་ནི་རྣམ་པར་བཟློག་གོ །ཤགས་འགྱེད་པ་ནི་ཞི་བར་བྱེད་དོ། །མདུད་པར་འཛིན་པ་ནི་རབ་ཏུ་སེལ་ཏོ། བཅིངས་པ་ཐམས་ཅད་ནི་ཡོངས་སུ་གཅོད་དོ། །བཙོན་ར་ཐམས་ཅད་ནི་མངོན་པར་འདྲལ་ལོ། །འཇིགས་པ་ནི་རྣམ་པར་བཟློག་གོ །
en: In that way, remaining in this gateway to omnipresent bodhisattva conduct, in all billion-world universes, in all the Trāyastriṃśa paradises, in all the Yāma paradises, in all the Tuṣita paradises, in all the Nirmāṇarati paradises, in all the Para­nirmita­vaśa­vartin paradises, in all the abodes of the māras, in all the places that are classed as paradises within all desire realms, in all the nāga worlds, in all the nāga abodes, in all the yakṣa worlds, in all the yakṣa abodes, in all the rākṣasa worlds, in all the rākṣasa abodes, in all the kumbhāṇḍa worlds, in all the kumbhāṇḍa abodes, in all the preta worlds, in all the preta abodes, in all the gandharva worlds, in all the gandharva abodes, in all the asura worlds, in all the asura abodes, in all the garuḍa worlds, in all the garuḍa abodes, in all the kinnara worlds, in all the kinnara abodes, in all the mahoraga worlds, in all the mahoraga abodes, in all the human worlds, in all the human abodes, villages, towns, market towns, districts, countries, and capitals, and for all classes of beings that are within all desire realms I teach the Dharma, reject all that is not Dharma, pacify all disputes, dispel all conflict, pacify all quarrels, prevent all battles, pacify wars, pacify hostility, cut through all bondage, break open all prisons, dispel all fear, and end the practice of nonvirtuous activities.

source: མི་དགེ་བའི་ལས་ཀྱི་འདུ་བྱེད་ནི་རྒྱུན་གཅོད་དོ། །སྲོག་གཅོད་པ་ལས་ནི་སེམས་ཅན་རྣམས་རྣམ་པར་ཟློག་གོ །མ་བྱིན་པར་ལེན་པ་དང་འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་ཕྲ་མ་དང་ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་ཆགས་སེམས་དང་།
en: I turn beings away from killing and from taking what is not given, sexual misconduct, telling lies, slandering, harsh speech, idle speech, avariciousness, maliciousness, and wrong views.

source: གནོད་སེམས་དང་ལོག་པར་ལྟ་བ་ལས་ནི་སེམས་ཅན་རྣམ་པར་ཟློག་གོ །མི་བྱ་བ་ཐམས་ཅད་ནི་བྱེད་དུ་མི་འཛུད་དོ། །དགེ་བའི་ཆོས་བྱ་བ་ཐམས་ཅད་ནི་བྱེད་དུ་འཛུད་དོ། །སེམས་ཅན་ཐམས་ཅད་ནི་བཟོ་ཐམས་ཅད་ལ་སློབ་ཏུ་འཛུད་དེ།
en: I turn beings away from all that should not be done and make them engage in all virtuous Dharma activity, and I make all beings train in all skills.

source: འཇིག་རྟེན་རྣམས་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཞགས་པ་འཐུབ་པ་ཐམས་ཅད་ལ་གོང་མའི་ཡེ་ཤེས་ཁྱད་པར་དུ་འཕགས་པ་བརྗོད་པའི་ཕྱིར་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བརྗོད་ཅིང་བསྟན་པའི་ཕྱིར་འཇིག་རྟེན་ལ་ཕན་པར་འགྱུར་བའི་གཙུག་ལག་ཐམས་ཅད་ཀྱང་སྟོན་ཏོ། །
en: I teach, prepare, elucidate, and present all the treatises that are beneficial to the world, so as to bring happiness to the world, to ripen beings, to follow false doctrines in order to describe the special higher wisdom, to dispel all wrong views, and to describe and teach all the Buddhadharma.

source: རྣམ་པར་འགོད་དོ། །རབ་ཏུ་གསལ་བར་བྱེད་དོ། །བརྗོད་དོ། །དེ་བཞིན་དུ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་གཟུགས་ཀྱི་ཁམས་ཀྱི་ལྷ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ་ཆོས་སྟོན་ཏོ།
en: I overwhelm and teach the Dharma to all the devas in the form realm as far up as the Brahmā paradise.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱོགས་བཅུར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཏུ་ཆོས་སྟོན་ཏེ།
en: “Just as I teach the Dharma in the world realms of this billion-world universe, I do so in world realms in the ten directions as numerous as the atoms in an indescribable quintillion buddha realms.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: I teach the Dharma of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་ཉན་ཐོས་ཀྱི་ཆོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་སྟོན་ཏོ།
en: I teach the Dharma of the bodhisattvas. I teach the Dharma of the śrāvakas and the Dharma of the pratyeka­buddhas.

source: སེམས་ཅན་དམྱལ་བ་ཡང་སྟོན་ཏོ།
en: I teach the hells.

source: སེམས་ཅན་དམྱལ་བར་འགྲོ་བའི་ལམ་དང་།
en: I teach the path that leads to the hells.

source: སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་གྱི་མི་བདེ་བའང་སྟོན་ཏོ། །
en: I teach the unhappiness of beings in the hells.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱང་སྟོན་ཏོ། །
en: I teach the animal existences.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ཐ་དད་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་དུ་འགྲོ་བའི་ལམ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སྡུག་བསྔལ་ཡང་སྟོན་ཏོ། །
en: I teach the different kinds of animal existences, the paths that lead to animal existences, and the suffering of animal existences.

source: གཤིན་རྗེའི་འཇིག་རྟེན་ཡང་སྟོན་ཏོ། །
en: I teach the world of Yama.

source: གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བའི་ལམ་དང་།
en: I teach the path that leads to the world of Yama.

source: གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཡང་སྟོན་ཏོ། །
en: I teach the suffering in the world of Yama.

source: མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ཡང་སྟོན་ཏོ། །
en: I teach the higher existences.

source: མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་འགྲོ་བའི་ལམ་དང་།
en: I teach the path that leads to the higher existences.

source: མཐོ་རིས་ཀྱི་འཇིག་རྟེན་གྱི་དགའ་བ་སྤྱོད་པ་དང་། ལོངས་སྤྱོད་ཀྱང་སྟོན་ཏོ། །
en: I teach the practice and enjoyment of happiness in the higher existences.

source: མིའི་འཇིག་རྟེན་ཡང་སྟོན་ཏོ། །
en: I teach the human world.

source: མྱིའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་འགྲོ་བའི་ལམ་དང་མིའི་འཇིག་རྟེན་གྱི་བདེ་བ་དང་།
en: I teach the path that leads to the human world.

source: སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བ་སྣ་ཚོགས་ཀྱང་སྟོན་ཏེ། དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཀྱང་སྟོན་ཏོ། །འཇིག་རྟེན་ཀུན་འབྱུང་བ་དང་།
en: I teach the various experiences of happiness and suffering in the human world.

source: འཇིག་རྟེན་ནུབ་པར་འགྱུར་བ་དང་། འཇིག་རྟེན་གྱི་ཁ་ན་མ་ཐོ་བ་དང་། འཇིག་རྟེན་ནས་འབྱུང་པ་ཡང་སྟོན་ཏོ། །དེ་ཡང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡང་དག་པར་བསྟན་པ་དང་། འཁོར་བའི་སྐྱོན་རྣམ་པར་བཟློག་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བརྗོད་པ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་མགོ་འཁོར་བ་དང་སྡུག་བསྔལ་དུ་གྱུར་པ་ཡང་དག་པར་སྟོན་པ་དང་།
en: “In that way, noble one, I also teach the Dharma of the world, the creation of the world, the destruction of the world, the transgressions in the world, and the renunciation of the world.

source: སྒྲིབ་པ་མེད་པའི་ཆོས་ཉིད་བརྗོད་པ་དང་། འཇིག་རྟེན་རྒྱུའི་བྱ་བ་ཡོངས་སུ་བསྟན་པ་དང་། འཇིག་རྟེན་འབྱུང་བ་དང་། ལྡོག་པའི་བདེ་བ་དང་། སྡུག་བསྔལ་ཐམས་ཅད་སྨོས་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་ཀྱི་མིང་དུ་བྱ་བ་རྣམ་པར་བསྒོམ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་གནས་པ་མེད་པ་མངོན་པར་བསྟན་པ་དང་། ལས་དང་ཉོན་མོངས་པའི་འཁོར་ལོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཤིན་ཏུ་བརྗོད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་དག་པའི་སྒོ་ཐམས་ཅད་དུ་འགྲོ་བ་དངོས་པོ་མེད་པ་ལ་གནས་པས་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་གྱི་མཐུས་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ཞིང་གི་དབྱིངས་ཐམས་ཅད་དུ་སྒྱུ་མ་ལྟ་བུའི་ཡེ་ཤེས་ཀྱི་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པ་ཀུན་ཏུ་ལྟ་བའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་ཐོབ་པ་ཚིག་གི་ལམ་དང་།
en: “In this way, I teach the Dharma in order to explain the bodhisattva path, reject the faults of saṃsāra, teach the qualities of omniscience, pacify the delusion and sufferings of the existences, describe the unobscured true nature, illuminate the activities of being in the world, describe all the happiness and suffering of being in the world, contemplate the designations of the abodes of all beings, teach the tathāgata qualities that have no location, counter the wheel of all karma and kleśas, and describe the turning of the tathāgata’s wheel of the Dharma.

source: སྒྲ་ཐམས་ཅད་རྣམ་པར་དམྱིགས་པ་ལ་ཤིན་ཏུ་གཞོལ་བའི་རྣ་བ་དང་ལྡན་པ། དུས་གསུམ་རྒྱས་པར་འགེངས་པའི་ཆོས་ཀྱི་སྒོ་སྣང་བ་ལ་དབང་རབ་ཏུ་ཐོབ་པ། ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའི་ཡེ་ཤེས་ལ་དབང་གིས་དབང་སྒྱུར་བའི་སྐྱེས་བུ་དཔའ་བོ་སེམས་ཅན་ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པའི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལམ་འདྲེས་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་དང་ལྡན་པའི་ལྕེ་ཡངས་ཤིང་སྲབ་ལ་ཡིད་དུ་འོང་བ་དང་ལྡན་པ། བསམ་པ་ཐ་དད་པའི་སེམས་ཅན་རྒྱ་མཚོའི་ཡིད་དུ་འོང་བའི་ཁ་དོག་དང་། དབྱིབས་སུ་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པའི་ལུས་སྒྱུ་མ་ལྟ་བུ་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མི་གཉིས་པའི་སྤྱོད་ལམ་གྱིས། བསམ་གྱིས་མི་ཁྱབ་པའི་ལུས་ལ་གཞོལ་བ། དུས་གསུམ་ཐམས་ཅད་དུ་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་ཀྱི་ལུས་དང་ལྡན་པ་ནམ་མཁའི་དབྱིངས་ལྟར་ཚད་མེད་པའི་སྤྱོད་ཡུལ་དཔག་ཏུ་མེད་པའི་ཡུལ་དང་ལྡན་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Noble one, I know this gateway to pure, omnipresent bodhisattva conduct, the stainless display of the noncomposite miracles based in the absence of existence, but how could I know the conduct or describe the qualities of the bodhisattvas who know all; who fill the surfaces of all realms with illusory bodies of wisdom; who have attained the level of the complete eyes of wisdom; who have the supreme hearing of the range of speech, sound, and communication; who have attained the power of the light of Dharma gateways that fill the three times; who are heroic beings who have the mastery of the power of the wisdom that includes all phenomena; who possess beautiful, fine tongues that are endowed with a domain of speech that is directed separately, according to their aspirations, to inconceivable, immeasurable beings; who have bodies that are like illusions and equal to all bodhisattvas, with complexions and forms that accord with the various wishes of an ocean of beings; who possess inconceivable bodies that have a conduct no different from that of all the tathāgatas; who have bodies of wisdom that follow all three times; and who have a scope and field of conduct that is as immeasurable and vast as the expanse of space?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཡུལ་ཤུ་མ་ཕྱི་མའི་མཐའ་ན། གྲོང་ཁྱེར་ཀ་ལིང་གའི་ནགས་ཚལ་ཞེས་བྱ་བ་ཡོད་ཏེ། དེ་ན་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in the land called Śroṇāparānta, there is a city by the name of Kaliṅgavana where dwells a bhikṣuṇī by the name of Siṃha­vijṛmbhitā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚོང་དཔོན་རྒྱལ་བ་དམ་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཚོང་དཔོན་རྒྱལ་བ་དམ་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཚོང་དཔོན་རྒྱལ་བ་དམ་པའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the head merchant Jayottama, circumambulated the head merchant Jayottama many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the head merchant Jayottama.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱི་ཡུལ་ཤུ་མ་ཕྱི་མའི་མཐའི་གྲོང་ཁྱེར་ཀ་ལིང་གའི་ནགས་ཚལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Siṃha­vijṛmbhitā Chapter 27 Sudhana, the head merchant’s son, set out for the town of Kaliṅgavana in the land of Śroṇāparānta and then arrived there.

source: དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཡོངས་སུ་ཚོལ་ཞིང་སེམས་ཅན་ཀུན་ལ་རྨེད་པའི་ཚེ། གང་ནས་གང་དུ་སོང་བ་དེ་དང་དེར་རོགས་པ་བརྒྱ་ཕྲག་དུ་མ་དང་།
en: Searching for the bhikṣuṇī Siṃha­vijṛmbhitā, as he roamed here and there he questioned the people he met.

source: བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་ཞིག་སྲང་དང་ལམ་གྱི་བཞི་མདོ་དང་། ལམ་གྱི་སུམ་མདོ་དག་ན་ཚོགས་ཏེ། རྗེས་སུ་འབྲང་ངོ་། །སྐྱེས་པ་བརྒྱ་ཕྲག་དུ་མ་དང་།
en: There were many hundreds of young men and many hundreds of young women assembling and following in the streets, crossroads, and street junctions, together with many hundreds of men and many hundreds of women.

source: བུད་མེད་བརྒྱ་ཕྲག་དུ་མ་ཞིག་གིས་ཀྱང་རིགས་ཀྱི་བུ་འདི་རེ་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ནི། གྲོང་ཁྱེར་ཀ་ལིང་གའི་ནགས་ཚལ་འདི་ཉིད་ཀྱི་བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་རྒྱལ་བའི་འོད་ཀྱིས་བྱིན་པ་ཉི་མའི་མདོག་ན་སེམས་ཅན་ཚད་མེད་པའི་དོན་དུ་ཆོས་སྟོན་ཅིང་འདུག་གོ་ཞེས་བསྟན་ཏོ། །
en: They said, “Noble one, the bhikṣuṇī Siṃha­vijṛmbhitā is in this town of Kaliṅgavana, sitting in the great park called Sūrya­prabha donated by Jayaprabha, where she is teaching the Dharma for the sake of countless beings.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཟའ་ཤིང་གི་ར་བ་ཉི་མའི་མདོག་དེར་ཕྱིན་ནས་ཀུན་ཏུ་བཙལ་ཏེ།
en: Then Sudhana, the head merchant’s son, went to Sūrya­prabha Park.

source: བལྟས་ན་བཟའ་ཤིང་གི་ར་བ་དེ་ན། ཤིང་ཟླ་བ་ཤར་བ་ཞེས་བྱ་བ་ཁང་པ་བརྩེགས་པའི་དབྱིབས་ལྟར་འདུག་པ། འོད་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཅན་འོད་ཀྱི་མདོག་དང་ལྡན་པ། འཁོར་ཀུན་ཏུ་དཔག་ཚད་ཀྱི་ཁྱོན་ཙམ་དུ་འོད་ཀྱིས་རྒྱས་པར་འགེངས་པ་མང་པོ་དང་།
en: Walking around it and looking about, he saw in the park many trees called candrodgata that had the shape of kūṭāgāras, had various colors of light, and shone with light, illuminating everywhere around up to a yojana.

source: ལོ་མའི་ཤིང་ཡོངས་སུ་འགེངས་པ་ཞེས་བྱ་བ་གདུགས་ཀྱི་རྣམ་པ་དང་དབྱིབས་སུ་འདུག་པའི་འདབ་མས་ཀུན་ནས་ཁེབས་པ། བཻཌཱུརྱ་སྔོན་པོའི་ཁ་དོག་ལྟར་འདུག་པའི་སྤྲིན་གྱི་མདོག་དང་ལྡན་པ་མང་པོ་དང་མེ་ཏོག་གི་ཤིང་མེ་ཏོག་གི་མཛོད་ཅེས་བྱ་བ།
en: He saw many leafy trees called saṃpracchada that had the shape of a parasol, and their leaves covered everywhere, like shining clouds the color of blue beryl.

source: རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་ལྟར་མདངས་དགའ་བའི་དབྱིབས་སྣ་ཚོགས་དང་ལྡན་པ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་མི་ཟད་པའི་ཆར་རབ་ཏུ་འབེབས་པ། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ཕོ་བྲང་གི་རྒྱན་གྱི་ཀུན་ནས་འདུ་བ་དང་།
en: He saw many blossoming trees called kusuma­kośa that had the varied beautiful shape of the Himalaya, king of mountains, and from which fell unceasing flows of a rain of flowers of various colors; they were an accumulation of all the adornments of the Trāyastriṃśa palace and could not be destroyed by anyone.

source: སུས་ཀྱང་མི་ཤིགས་པ་ལྟ་བུ་མང་པོ་དང་། ཤིང་ཏོག་གི་ཤིང་རྟག་ཏུ་སྨིན་པའི་རོ་དཔེ་མེད་པའི་འབྲས་བུའི་ཚོགས་ཤེས་བྱ་བ་གསེར་གྱི་རི་བོའི་ལྷུན་ལྟར་འདུག་པ། རྟག་ཏུ་ཤིང་ཏོག་ཕུན་སུམ་ཚོགས་པར་གནས་པ་མང་པོ་དང་།
en: He saw many fruit trees called anupama­svādu­phala­nicita, which had the form of gold mountain peaks and always had perfect fruit that was always ripe.

source: རིན་པོ་ཆེའི་རྒྱལ་པོའི་ཤིང་རྣམ་པར་སྣང་བའི་མཛོད་ཅེས་བྱ་བ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དཔེ་མེད་པའི་དབྱིབས་ལྟར་འདུག་པ། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ཕྲེང་བ་དང་།
en: He saw many trees of kings of jewels called vairocanakośa that had the shapes of incomparable kings of jewels and possessed perfect divine strings of jewels, necklaces, and precious adornments that seemed to have come from the treasury of the kings of wish-fulfilling jewels and were the source of jewels of countless colors.

source: སེ་མོ་དོ་དང་། རྒྱན་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་མཛོད་ནས་བྱུང་བ་ལྟར་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ། རིན་པོ་ཆེའི་ཁ་དོག་གྲངས་མེད་པའི་འབྱུང་གནས་སུ་གྱུར་པ་མང་པོ་དང་། གོས་ཀྱི་ཤིང་དགའ་བར་བྱེད་པ་ཞེས་བྱ་བ་ལྷ་རྫས་ཀྱི་གོས་རིན་པོ་ཆེའི་ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཚོགས་རབ་ཏུ་འགྱེད་ཅིང་འཕྱང་བས་ཤིན་ཏུ་བརྒྱན་པ་མང་པོ་དང་།
en: He saw many cloth trees called prasādana, which were adorned by being strewn and hung with precious divine cloths of various colors.

source: རོལ་མོའི་ཤིང་དགའ་བསྐྱེད་པ་ཞེས་བྱ་བ་ལྷ་རྫས་ལས་ཀྱང་ལྷག་པའི་རོལ་མོ་ཡིད་དུ་འོང་བའི་སྒྲ་སྙན་པ་འབྱིན་པ་མང་པོ་དང་།
en: He saw many music trees called pramodana, which emitted the sounds of beautiful music from instruments superior to those of the devas.

source: སྤོས་ཀྱི་ཤིང་ཀུན་ཏུ་ཞིམ་པས་བརྒྱན་པ་ཞེས་བྱ་བ་ཕྱོགས་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་རྣམ་པ་ཐམས་ཅད་དུ་ཡིད་དུ་འོང་བའི་སྤོས་ཀྱི་ངད་འབྱུང་བ་མང་པོ་དག་ཀྱང་ཡོད་པར་མཐོང་། མཚེའུ་དང་ལུ་མ་དང་། ལྟེང་ཀ་དང་།
en: He saw many perfume trees called samanta­śubha­vyūha, from which arose pleasing perfumes of every kind of pleasant aroma spreading freely in all directions.

source: རྫིང་བུ་རིན་པོ་ཆེ་བདུན་གྱི་ཕ་གུས་མཐའ་བརྩིགས་པ། ཕྱོགས་བཞི་ནས་རིན་པོ་ཆེའི་ཐེམ་སྐས་བཙུགས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁྲི་འཕང་དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་དྲི་ཞིམ་པོས་བསྐུས་པས་ཀུན་ནས་བསྐོར་བ། གཞི་རིན་པོ་ཆེའི་རྒྱལ་པོ་བཻཌཱུརྱ་སྔོན་པོ་ལས་ལེགས་པར་བླངས་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་བྱེ་མ་བདལ་བ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུ་ལྷ་རྫས་ཀྱི་དྲི་ཡིད་དུ་འོང་བ་ཅན་གྱིས་ཡོངས་སུ་གང་བ། རིན་པོ་ཆེའི་པད་མོ་དང་། ཨུཏྤ་ལ་དང་། ཀུ་མུ་ཏ་དང་།
en: There were springs, ponds, reservoirs, and pools that had balustrades made of the seven precious materials around them, with precious steps on all four sides, encircled by precious platforms perfumed with the pleasant aroma of yellow sandalwood, with perfectly laid bottoms made of precious blue beryl, the king of jewels, and which were spread with the sand of Jambu River gold and filled with aromatic divine water that had the eight qualities.

source: མེ་ཏོག་པུན་ད་རི་ཀ་ཁ་དོག་སྣ་ཚོགས་ལྷ་རྫས་ཀྱི་བསུང་དང་ལྡན་པས། ཆུ་ཀུན་ནས་ཡོག་པ། བྱ་བྲན་སྣ་ཚོགས་ཀྱི་ཁྱུ་ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་གཟུགས་ཡིད་དུ་འོང་བ་དང་ལྡན་པ། སྒྲ་སྙན་པ་འབྱིན་ཅིང་བརྗོད་པས་གང་བ། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ཕྲེང་བ་ལེགས་པར་བཀྱེ་བས་ཡོངས་སུ་བསྐོར་ཅིང་བརྒྱན་པ་དང་ལྡན་པ་ཤིང་སྣ་ཚོགས་དེ་དག་གི་དྲུང་ཐམས་ཅད་དུའང་རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་སྣ་ཚོགས་ཡིད་དུ་འོང་བའི་གཟུགས་དང་ལྡན་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དུ་མས་བརྒྱན་པ། ལྷ་རྫས་ཀྱི་སྟན་རིན་པོ་ཆེ་སྣ་ཚོགས་འབེལ་བར་བཏིང་བ། ལྷ་རྫས་ཀྱི་སྤོས་དང་། བདུག་སྤོས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱིས་བདུགས་པ། ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་དར་རིན་པ་ཆེ་མངོན་པར་སྤྱངས་བ།
en: Their waters were covered with the various colors and divine scents of precious lotuses, blue lotuses, night lotuses, and white lotuses; were filled with flocks of various birds, with beauty that transcended the divine, emitting beautiful sounds; and were beautified by being encircled with radiant trees made of various divine jewels.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་བླ་རེ་བཀྱེ་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་དྲ་བ་སྣ་ཚོགས་ཀུན་ནས་བྲེས་པ། རིན་པོ་ཆེའི་དྲིལ་གྱི་དྲ་བ་ཡིད་དུ་འོང་ཞིང་སྙན་པའི་སྒྲ་འབྱིན་པ། མང་པོས་བརྒྱན་པ། འཁོར་དུ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྟན་བརྒྱ་ཕྲག་དུ་མ་བཏིང་ཞིང་བཤམས་པ་མཐོང་ངོ་། །
en: Arranged at the feet of all those trees of various jewels were precious lion thrones, with various beautiful forms, arrayed in inconceivable adornments of various jewels, adorned and spread with divine precious cushions, perfumed by all kinds of scents and incenses, hung with precious, beyond-divine ribbons, canopied by canopies of various jewels, covered by nets of Jambu River gold and various jewels, adorned by many precious beautiful nets of bells that emitted beautiful sounds, and accompanied by many hundreds of thousands of seats made of divine jewels.

source: རིན་པོ་ཆེའི་ཤིང་དྲུང་ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པདྨོའི་སྙིང་པོ་ཅན་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེའི་སྤོས་ཀྱི་རྒྱལ་པོའི་པད་མོའི་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཀླུའི་རྒྱན་གྱི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སེང་གེའི་བྱ་ལའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཕྱོགས་རྣམ་པར་སྣང་བའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་དབང་པོའི་རྡོ་རྗེའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བའི་ཡིད་དུ་འོང་བའི་པདྨོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །རིན་པོ་ཆེའི་ཤིང་དྲུང་ལ་ལར་ནི་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་མདོག་དཀར་པོའི་པད་མོས་སྙིང་པོ་བྱས་པ་བཤམས་པ་མཐོང་ངོ་། །
en: He saw, arranged at the feet of some jewel trees, lion thrones with lotuses in their centers that were made of jewels; at the feet of some, lion thrones with lotuses in their centers that were made of the precious jewel king of perfumes; at the feet of some, lion thrones with lotuses in their centers that were made of the king of jewels array of nāgas; at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels lion’s trunk; at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels the sun; at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels radiance; at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels Indra’s vajra; at the feet of some, lion thrones with lotuses in their centers that were made of the king of precious jewels beauty of the world; and he saw, arranged at the feet of some jewel trees, lion thrones with lotuses in their centers that were made of the king of precious jewels white light.

source: བཟའ་ཤིང་གི་ར་བ་དེའི་གཞི་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་ཞིང་རྒྱ་མཚོ་ཆེན་པོ་ལྟར་རིན་པོ་ཆེའི་གླིང་གིས་ཡོངས་སུ་གང་བ་མཐོང་ངོ་། །བཻཌཱུརྱ་སྔོན་པོའི་དམ་པས་སྤྲས་ཏེ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་ས་ཕྱོགས་ཀ་ཙ་ལིན་ད་ལྟར་རེག་ན་བདེ་ཞིང་འཇམ་པ། གོམ་པ་བོར་ཞིང་བཏེག་པའི་ཚེ་མཐོ་དམན་མེད་པ། རྡོ་རྗེ་རིན་པོ་ཆེ་མཆོག་གི་པདྨོའི་དྲི་ཡིད་དུ་འོང་བར་ཞིམ་ཞིང་རེག་ན་བདེ་བའི་སིལ་མ་ཀུན་ཏུ་བཀྲམ་པ། ང་ངུར་དང་། རྨ་བྱ་དང་། ཁྲུང་ཁྲུང་དང་། ཀུ་ན་ལ་དང་། ཀ་ལ་པིང་ཀ་དང་།
en: He saw that the entire ground of that great park was covered with various jewels like an ocean covered by islands of jewels.

source: ཀོ་ཀི་ལ་དང་། ཛི་བན་ཛི་བ་ཀ་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བའི་ང་རོ་འབྱིན་པ་མང་པོས་གང་བ། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ཙན་དན་གྱི་ཤིང་མང་པོའི་ནགས་ཚལ་ཤིན་ཏུ་ལེགས་པར་འགྲིགས་པས་བརྒྱན་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་པདྨོའི་སྤྲིན་གྱི་ཆར་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་མི་ཟད་པའི་ཆར་རྒྱུན་ཏུ་འབབ་པ། འདྲེས་པའི་ནགས་ཚལ་ལས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་བུ་བརྩེགས་མ་བརྒྱན་པར་བཀོད་པའི་ནང་ནས། སྤོས་ཀྱི་རྒྱལ་པོའི་བདུག་སྤོས་རིན་ཐང་མེད་པ་རྟག་ཏུ་འཐུལ་ཞིང་ཞིམ་པ་ལྷའི་མདུན་ས་ཆོས་བཟང་པོའི་རྒྱན་ལས་ཀྱང་ལྷག་པར་བརྒྱན་པ། ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་རིན་པོ་ཆེའི་དྲ་བ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་བྲེས་པ། མུ་ཏིག་རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཕྲེང་བ་དང་།
en: He saw that the land was beautified by blue beryl dust, was adorned with various jewels, and was as pleasant and soft to the touch as down; it sank as one stepped on it and rose as one lifted the foot; its surface was strewn with the petals of beautifully aromatic lotuses that were pleasant to the touch and made of diamond jewels; it was filled with ruddy shelducks, peacocks, cranes, snipes, avadavats, cuckoos, and partridges that emitted beautiful sounds; it was adorned by perfectly formed forests of many divine, precious sandalwood trees; there was a continuous rainfall from clouds of lotuses made of various jewels and a rain of various precious flowers; it was superior to Miśrakavana; there were kūṭāgāras made of various jewels arrayed as adornments from within which constantly emanated the unequaled aromas of the kings of perfumes; it was a display superior to that of Sudharma, the meeting hall of the devas; they were covered with nets of various jewels that were superior to divine jewels; they were adorned by hanging bundles of pearls, jewels, and flowers; they were entirely adorned by shining gold nets arrayed with a variety of precious bells.
